test_bench/cceh_buflog_4.log
key trace size: 50000000
------------------------------------------------
HashType:              CCEH buflog
Init Capacity:         16777216
Entries:               50000000
Trace size:            50000000
Read:                  1000000 
Write:                 1000000 
Thread:                4 
Report interval:       0 s
Stats interval:        10000000 records
benchmarks:            load,readrandom
------------------------------------------------
Start IPMWatcher for load
thread  0, between 0 - 12500000
thread  1, between 12500000 - 25000000
thread  2, between 25000000 - 37500000
thread  3, between 37500000 - 50000000
2021/04/07-00:55:04  ... thread 0: (10000000,10000000) ops and ( 1149009.4,1149009.4 ) ops/second in (8.7031,8.7031) seconds
2021/04/07-00:55:04  ... thread 3: (10000000,10000000) ops and ( 1148890.6,1148890.6 ) ops/second in (8.7040,8.7040) seconds
2021/04/07-00:55:04  ... thread 1: (10000000,10000000) ops and ( 1134640.5,1134640.5 ) ops/second in (8.8134,8.8134) seconds
2021/04/07-00:55:04  ... thread 2: (10000000,10000000) ops and ( 1126795.6,1126795.6 ) ops/second in (8.8747,8.8747) seconds
load         :       0.234 micros/op 4.069049 Mops/s;
DIMM0 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.61 |         9.07 |  19.16 | 624.47 |
DIMM1 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |       8362.80 |        4312.41 |    16484.22 |      9955.80 |   1.97 |   2.31 |
DIMM2 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.59 |         9.07 |  18.61 | 624.13 |
DIMM3 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.64 |         9.10 |  20.30 | 626.52 |
DIMM4 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.64 |         9.10 |  20.13 | 626.40 |
DIMM5 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.59 |         9.06 |  18.53 | 623.45 |
*SUM* | DIMM-R:  1406.9 MB/s. User-R:   713.6 MB/s   | DIMM-W:   853.4 MB/s, User-W:   368.0 MB/s. Time:  11.72s.
App Read:  8363.0 MB, Raw Read: 16487.3 MB, App Write:  4312.5 MB, Raw Write: 10001.2 MB
Destroy IPMWatcher.

Start IPMWatcher for readrandom
readrandom   :       0.246 micros/op 3.878834 Mops/s; (num: 1000000, not find: 0)
DIMM0 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.06 |         0.90 |   1.89 |  61.85 |
DIMM1 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |       1046.10 |         154.98 |     2388.21 |       625.60 |   2.28 |   4.04 |
DIMM2 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.06 |         0.90 |   1.93 |  62.08 |
DIMM3 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.06 |         0.90 |   2.03 |  62.20 |
DIMM4 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.06 |         0.90 |   2.02 |  62.13 |
DIMM5 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.06 |         0.90 |   1.92 |  62.03 |
*SUM* | DIMM-R:  2427.9 MB/s. User-R:  1063.5 MB/s   | DIMM-W:   640.5 MB/s, User-W:   157.6 MB/s. Time:   0.98s.
App Read:  1046.3 MB, Raw Read:  2388.5 MB, App Write:   155.1 MB, Raw Write:   630.1 MB
Destroy IPMWatcher.