test_bench/cceh_buflog_8.log
key trace size: 50000000
------------------------------------------------
HashType:              CCEH buflog
Init Capacity:         16777216
Entries:               50000000
Trace size:            50000000
Read:                  1000000 
Write:                 1000000 
Thread:                8 
Report interval:       0 s
Stats interval:        10000000 records
benchmarks:            load,readrandom
------------------------------------------------
Start IPMWatcher for load
thread  7, between 43750000 - 50000000
thread  6, between 37500000 - 43750000
thread  4, between 25000000 - 31250000
thread  1, between 6250000 - 12500000
thread  0, between 0 - 6250000
thread  2, between 12500000 - 18750000
thread  5, between 31250000 - 37500000
thread  3, between 18750000 - 25000000
load         :       0.175 micros/op 5.445715 Mops/s;
DIMM0 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.45 |         6.82 |  14.20 | 469.33 |
DIMM1 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |       8300.34 |        4314.85 |    17249.85 |     10945.06 |   2.08 |   2.54 |
DIMM2 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.44 |         6.83 |  14.02 | 470.37 |
DIMM3 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.48 |         6.85 |  15.18 | 471.38 |
DIMM4 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.45 |         6.82 |  14.20 | 469.70 |
DIMM5 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.44 |         6.82 |  14.07 | 469.53 |
*SUM* | DIMM-R:  1970.1 MB/s. User-R:   947.9 MB/s   | DIMM-W:  1253.8 MB/s, User-W:   492.7 MB/s. Time:   8.76s.
App Read:  8300.5 MB, Raw Read: 17252.1 MB, App Write:  4314.9 MB, Raw Write: 10979.2 MB
Destroy IPMWatcher.

Start IPMWatcher for readrandom
readrandom   :       0.172 micros/op 5.545464 Mops/s; (num: 1000000, not find: 1)
DIMM0 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.08 |         1.19 |   2.50 |  81.66 |
DIMM1 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |       2174.08 |         292.85 |     4691.29 |      1179.46 |   2.16 |   4.03 |
DIMM2 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.08 |         1.19 |   2.49 |  81.76 |
DIMM3 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.09 |         1.19 |   2.69 |  82.08 |
DIMM4 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.08 |         1.19 |   2.50 |  81.65 |
DIMM5 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.08 |         1.19 |   2.45 |  81.65 |
*SUM* | DIMM-R:  3408.6 MB/s. User-R:  1579.6 MB/s   | DIMM-W:   861.2 MB/s, User-W:   212.8 MB/s. Time:   1.38s.
App Read:  2174.2 MB, Raw Read:  4691.7 MB, App Write:   292.9 MB, Raw Write:  1185.4 MB
Destroy IPMWatcher.